## Dataset Features Meaning
1. Pclass = Ticket Class based on socio-economic status: 1st - Upper
2nd - Middle
3rd - Lower 

2. SibSp = No of siblings/spouse aboard the titanic: 
Siblings - brother, sister, step brother, step sister.
Spouse - husband, wife

3. Parch = family relations: parent , child
    Child travelling with nanny, parch = 0
    
4. Embarked = Port of entry for each passenger:
C - cherbourg 
Q - Queenstown
S - Southampton

### Questions to Ask

1. How many people survived in total?
2. How many female survived?
3. How many male survived?
4. categorize people from socio-economic class that survived?
5. Categorize people that embarked from different ports based on survival?
6. Number of SibSp that survived?
7. Number of Parch that survived?
8. Age range of the highest and lowest survivors?

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
plt.style.use('ggplot')

In [3]:
pd.set_option('display.max_columns', 100)

In [4]:
data = pd.read_csv(r'C:\Users\chose\alexanderchosen\Personal\ML\eda_with_python\Titanic_dataset_eda\Titanic-Dataset.csv')

In [5]:
data.shape

(891, 12)

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
data.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
# Data Preparation

data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df = data[[#'PassengerId', 
    'Survived', 'Pclass', 
    #'Name', 
    'Sex', 
    'Age', 'SibSp',
       'Parch', 
       #'Ticket', 'Fare', 'Cabin', 
       'Embarked']].copy()

In [16]:
df.shape

(891, 7)

In [17]:
df.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Embarked     object
dtype: object

In [18]:
df['SibSp'].value_counts()

SibSp
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: count, dtype: int64

In [19]:
df['Parch'].value_counts()

Parch
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: count, dtype: int64

In [20]:
# renaming columns
df = df.rename(columns ={'Pclass': 'passenger_class',
                         'Parch': 'parent_child',
                         'SibSp': 'siblings_spouse'})

In [21]:
df.head()

,Survived,passenger_class,Sex,Age,siblings_spouse,parent_child,Embarked
0,0,3,male,22.0,1,0,S
1,1,1,female,38.0,1,0,C
2,1,3,female,26.0,0,0,S
3,1,1,female,35.0,1,0,S
4,0,3,male,35.0,0,0,S

In [22]:
# checking for missing values
df.isna().sum()

Survived             0
passenger_class      0
Sex                  0
Age                177
siblings_spouse      0
parent_child         0
Embarked             2
dtype: int64

In [23]:
# we have to look for the mean value of the age column and replace the missing values with it
df[df['Age'].isna()]

,Survived,passenger_class,Sex,Age,siblings_spouse,parent_child,Embarked
5,0,3,male,NaN,0,0,Q
17,1,2,male,NaN,0,0,S
19,1,3,female,NaN,0,0,C
26,0,3,male,NaN,0,0,C
28,1,3,female,NaN,0,0,Q
...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,C
863,0,3,female,NaN,8,2,S
868,0,3,male,NaN,0,0,S
878,0,3,male,NaN,0,0,S
888,0,3,female,NaN,1,2,S

In [28]:
# to get the mean value for Age column
mean_age = round(df['Age'].mean(), 1)
mean_age

29.7

In [42]:
df.replace({'Age': np.nan},{'Age': mean_age}, inplace = True)
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.7
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [38]:
# to replace with the mean value
df['Age'].replace(np.nan, mean_age, inplace = True)

df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.7
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [39]:
# is this correct
#df.replace({'Age': np.nan},{'Age': mean_age}, inplace = True) 
#df['Age']
df['Age'].isna().sum()

0

In [51]:
# to replace NaN in the Embarked column with the mode
mode_embarked = df['Embarked'].mode()[0]
mode_embarked

'S'

In [52]:
df['Embarked'].replace(np.nan, mode_embarked, inplace = True)

In [53]:
df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object